In [1]:
import pandas as pd

In [2]:
import numpy as np

In [3]:
import os

In [4]:
dict ={"country":["Brazil","Russia","India","China","Africa"],
       "capital":["Brasilia","Moscow","New Delhi","Beijing","Pretoria"],
       "area":["200","232","563","7332","534"]
      }

In [5]:
a=pd.DataFrame(dict)

In [8]:
a.head()

   area    capital country
0   200   Brasilia  Brazil
1   232     Moscow  Russia
2   563  New Delhi   India
3  7332    Beijing   China
4   534   Pretoria  Africa

In [12]:
a[1:3]

  area    capital country
1  232     Moscow  Russia
2  563  New Delhi   India

In [15]:
print(a['area'])

0     200
1     232
2     563
3    7332
4     534
Name: area, dtype: object

In [10]:
a.iloc[:2]

  area   capital country
0  200  Brasilia  Brazil
1  232    Moscow  Russia

In [11]:
a.loc[:3]

   area    capital country
0   200   Brasilia  Brazil
1   232     Moscow  Russia
2   563  New Delhi   India
3  7332    Beijing   China

In [17]:
a.iloc[:3,:2]

  area    capital
0  200   Brasilia
1  232     Moscow
2  563  New Delhi

## Transpose

In [18]:
a.T

                0       1          2        3         4
area          200     232        563     7332       534
capital  Brasilia  Moscow  New Delhi  Beijing  Pretoria
country    Brazil  Russia      India    China    Africa

In [19]:
a

   area    capital country
0   200   Brasilia  Brazil
1   232     Moscow  Russia
2   563  New Delhi   India
3  7332    Beijing   China
4   534   Pretoria  Africa

## axes

In [20]:
a.axes

[RangeIndex(start=0, stop=5, step=1),
 Index(['area', 'capital', 'country'], dtype='object')]

## datatypes

In [21]:
a.dtypes

area       object
capital    object
country    object
dtype: object

In [22]:
a.empty

False

In [23]:
a.shape

(5, 3)

In [24]:
a.size

15

In [25]:
a.values

array([['200', 'Brasilia', 'Brazil'],
       ['232', 'Moscow', 'Russia'],
       ['563', 'New Delhi', 'India'],
       ['7332', 'Beijing', 'China'],
       ['534', 'Pretoria', 'Africa']], dtype=object)

In [26]:
a.head(3)

  area    capital country
0  200   Brasilia  Brazil
1  232     Moscow  Russia
2  563  New Delhi   India

In [28]:
a.tail(3)

   area    capital country
2   563  New Delhi   India
3  7332    Beijing   China
4   534   Pretoria  Africa

In [29]:
a.sum()

area                             2002325637332534
capital    BrasiliaMoscowNew DelhiBeijingPretoria
country              BrazilRussiaIndiaChinaAfrica
dtype: object

In [32]:
a.describe()

       area    capital country
count     5          5       5
unique    5          5       5
top     200  New Delhi   China
freq      1          1       1

In [33]:
a

   area    capital country
0   200   Brasilia  Brazil
1   232     Moscow  Russia
2   563  New Delhi   India
3  7332    Beijing   China
4   534   Pretoria  Africa

In [34]:
a.mean()

area    4.004651e+14
dtype: float64

In [35]:
a.corr()

Empty DataFrame
Columns: []
Index: []

In [36]:
a.std()

Series([], dtype: float64)

In [40]:
b=pd.DataFrame([0,1,2,3]),indexing=([a,b,c,d])

SyntaxError: can't assign to function call (<ipython-input-40-9a191bda8da9>, line 1)